lib/tasks/dev.rake

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_extra_admins: :environment do
    10.times do |i|
      Admin.create!(
          email: Faker::Internet.email,
          password: DEFAULT_PASSWORD,
          password_confirmation: DEFAULT_PASSWORD
        )

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Acionamentos e controles elétricos"], ["created_at", "2021-09-22 10:16:30.906725"], ["updated_at", "2021-09-22 10:16:30.906725"]]
---
  task add_subjects: :environment do
    file_name = 'subjects.txt'
    file_path = File.join(DEFAULT_FILES_PATH, file_name)
    File.open(file_path, 'r').each do |line|
      Subject.create!(description: line.strip)

SELECT "subjects".* FROM "subjects"
INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_answers_and_questions: :environment do
    Subject.all.each do |subject|
      rand(5..10).times do |i|
        params = create_question_params(subject)
        answers_array = params[:question][:answers_attributes]
        add_answers(answers_array)
        elect_true_answer(answers_array)
        Question.create!(params[:question])