app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page]).per(5)
---
SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$12$1MPPy5WzSaRueR31BGxL2OJORX2PmkyGXVRsl88Xd.d1o8z.Qtkpy"], ["updated_at", "2021-09-20 18:05:29.194947"], ["id", 12]]