app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    if params[:admin][:password].blank? && params[:admin][:password_confirmation].blank?
      params[:admin].extract!(:password, :password_confirmation)
    end
    @admin = Admin.find(params[:id])