app/controllers/admins_backoffice/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"
---
  def index
    @questions = Question.includes(:subject).order(:description).page(params[:page])