app/controllers/admins_backoffice/subjects_controller.rb

  def index
    @subjects = Subject.all.order(:description).page(params[:page]).per(10)
---
SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"

  def create
    @subject = Subject.new(params_subject)
    if @subject.save
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", ""], ["created_at", "2021-09-21 18:37:51.846585"], ["updated_at", "2021-09-21 18:37:51.846585"]]

  def destroy
    if @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 253]]